ErpTest/src/Catalogs/ItobТерминалы/ItobТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItobТерминалы</name>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.ItobМоделиТерминалов</types>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерSimКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсреднятьЗначениеПоТопливу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Датчики</name>
    <attributes>
      <name>Датчик</name>
      <type>
        <types>CatalogRef.ItobДатчики</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.ItobНазначенияДатчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>КалибровочныйГрафик</name>
      <type>
        <types>CatalogRef.ItobКалибровочныеГрафики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Catalogs/ItobТерминалы/Forms/ФормаЭлемента/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем мФормироватьНаименованиеАвтоматически;  // надо ли формировать автоматически Наименование, или нет
	
#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Функция ПолучитьКоличествоДатчиковТоплива()

	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	Результат = 0;	
	
	Для каждого ТекущаяСтрока Из ТекОбъект.Датчики Цикл
		Если ТекущаяСтрока.Назначение.ДатчикТоплива Тогда
		    Результат = Результат + 1;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ПолучитьКоличествоДатчиковТоплива()


// Функция формирует наименование терминала.
//
&НаКлиенте
Функция СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = ?(Объект.Модель.Пустая(), Формат(Объект.Код, "ЧГ=0"),
	              Строка(Объект.Модель)+" ("+Формат(Объект.Код, "ЧГ=0")+")");
	                        СтрокаНаименования = Лев(СтрокаНаименования, 50);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Если НЕ Объект.Модель.Пустая() Тогда
		
		СтрокаНаименования2 = Формат(Объект.Код, "ЧГ=0")+ " ("+Строка(Объект.Модель)+")";
		СтрокаНаименования2 = Лев(СтрокаНаименования2, 50);
	
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования2);		
	
	КонецЕсли;
			
	Возврат СтрокаНаименования;

КонецФункции // СформироватьАвтоНаименование()

// Процедура проверяет, совпадало ли ранее наименование с кодом,
// и присваивает соответствующее значение переменной мФормироватьНаименованиеАвтоматически.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура УстановитьФлагФормироватьНаименованиеАвтоматически()

	Если ПустаяСтрока(Объект.Наименование) 
	 ИЛИ Объект.Наименование = Формат(Объект.Код, "ЧГ=0")
	 ИЛИ Объект.Наименование = СформироватьАвтоНаименование() Тогда
		мФормироватьНаименованиеАвтоматически = Истина;
	Иначе
		мФормироватьНаименованиеАвтоматически = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьФлагФормироватьНаименованиеАвтоматически()

// Процедура устанавливает видимость элементов формы
//
&НаКлиенте
Процедура УстановитьВидимость()
	
	КоличествоДатчиковТоплива = ПолучитьКоличествоДатчиковТоплива();
	
	Если КоличествоДатчиковТоплива > 1 Тогда
		Элементы.УсреднятьЗначениеПоТопливу.Видимость = Истина;
		Элементы.НадписьУсреднение.Видимость = Истина;
		Если Объект.УсреднятьЗначениеПоТопливу Тогда
			Элементы.НадписьУсреднение.Заголовок = НСтр("ru = 'Данные по всем датчикам топлива будут усреднены 
												   |(датчики топлива установлены в одном баке)'");
		Иначе	
			Элементы.НадписьУсреднение.Заголовок = НСтр("ru = 'Данные по всем датчикам топлива будут суммироваться
												   |(датчики топлива установлены в разных баках)'");
		КонецЕсли; 
	Иначе
		Элементы.УсреднятьЗначениеПоТопливу.Видимость = Ложь;
		Элементы.НадписьУсреднение.Видимость = Ложь;
	КонецЕсли; 	
	
КонецПроцедуры // УстановитьВидимость()
	
#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// Процедура - обработчик события "ПередЗаписью" формы.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "Код".
//
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьАвтоНаименование();
	мФормироватьНаименованиеАвтоматически = Истина;
		
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "Наименование".
//
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	УстановитьФлагФормироватьНаименованиеАвтоматически();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "Модель".
//
&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьАвтоНаименование();
	мФормироватьНаименованиеАвтоматически = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатчикиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура УсреднятьЗначениеПоТопливуПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

	
#КонецОбласти
